wql7013/ESP32WROOM-WiFi/ESP32WROOM.cpp
#include "ESP32WROOM.h"

//#define DEBUG
extern volatile uint32_t g_ul_ms_ticks;
extern "C" {
	void wdt_restart(Wdt* p_wdt);
}

MyRingBuffer::MyRingBuffer(void)
{
	memset(_aucBuffer, 0, BUFFER_MAX_SIZE);
	_iHead = 0;
	_iTail = 0;
}

void MyRingBuffer::store_byte(uint8_t c)
{
	int i = (uint32_t)(_iHead + 1) % BUFFER_MAX_SIZE;

	_aucBuffer[_iHead] = c;
	_iHead = i;
	if (i == _iTail)
	{
		_iTail = (uint32_t)(_iTail + 1) % BUFFER_MAX_SIZE;
	}
}

bool MyRingBuffer::is_full(void)
{
	int i = (uint32_t)(_iHead + 1) % BUFFER_MAX_SIZE;
	return i == _iTail;
}

int MyRingBuffer::find_byte(byte c, int begin, int end)
{
	int len = length();
	if (end == -1 || end > len) end = len;
	if (begin >= end) return -1;
	int i = _iTail + begin, j = begin;
	while (j < end)
	{
		if (_aucBuffer[i] == c)
		{
			return j;
		}
		i = (uint32_t)(i + 1) % BUFFER_MAX_SIZE;
		j++;
	}
	return -1;
}

// kmp algorithm for find_bytes
static void Next(byte* T, int* next, int size) {
	int i = 1;
	next[1] = 0;
	int j = 0;
	while (i < size) {
		if (j == 0 || T[i - 1] == T[j - 1]) {
			i++;
			j++;
			next[i] = j;
		}
		else {
			j = next[j];
		}
	}
}

int MyRingBuffer::find_bytes(byte* p, size_t n)
{
	int next[FINDBYTES_MAX_SIZE + 1];
	Next(p, next, n);
	int i = 1;
	int j = 1;
	int s_size = length();
	while (i <= s_size && j <= n) {
		if (j == 0 || read_byte(i - 1) == p[j - 1]) {
			i++;
			j++;
		}
		else {
			j = next[j];
		}
	}
	if (j > n) {
		return i - n - 1;
	}
	return -1;
}

int MyRingBuffer::find_word(uint16_t w, int begin)
{
	if (begin >= length()) return -1;
	int i = _iTail + begin, j = begin;
	uint8_t L = w & 0xff;
	uint8_t H = w >> 8;
	while (i != _iHead)
	{
		if (_aucBuffer[i] == L)
		{
			int k = (uint32_t)(i + 1) % BUFFER_MAX_SIZE;
			if (k != _iHead)
			{
				if (_aucBuffer[k] == H)
				{
					return j;
				}
			}
		}
		i = (uint32_t)(i + 1) % BUFFER_MAX_SIZE;
		j++;
	}
	return -1;
}

bool MyRingBuffer::cmp_bytes(byte* p, size_t n, int begin)
{
	if (n == 0)
	{
		n = strlen((char*)p);
	}
	if (begin + n > length()) return false;
	int i = (uint32_t)(_iTail + begin) % BUFFER_MAX_SIZE;
	int j = 0;
	while (j < n)
	{
		if (p[j] != _aucBuffer[i])
		{
			return false;
		}
		i = (uint32_t)(i + 1) % BUFFER_MAX_SIZE;
		j++;
	}
	return true;
}

void MyRingBuffer::cut(int count)
{
	if (count > length())
		clear();
	else
		_iTail = (uint32_t)(_iTail + count) % BUFFER_MAX_SIZE;
}

int MyRingBuffer::length(void)
{
	if (_iTail <= _iHead)
		return _iHead - _iTail;
	else
		return _iHead + BUFFER_MAX_SIZE - _iTail;
}

void MyRingBuffer::clear(void)
{
	_iTail = _iHead;
}

uint8_t MyRingBuffer::operator[](int index)
{
	return read_byte(index);
}

uint8_t MyRingBuffer::read_byte(int index)
{
	int i = (uint32_t)(_iTail + index) % BUFFER_MAX_SIZE;
	return _aucBuffer[i];
}

size_t MyRingBuffer::read_bytes(uint8_t* buffer, size_t n, int begin)
{
	if (begin >= length()) return 0;
	int i = (uint32_t)(_iTail + begin) % BUFFER_MAX_SIZE;
	int j = 0;
	while (i != _iHead && j < n)
	{
		buffer[j] = _aucBuffer[i];
		i = (uint32_t)(i + 1) % BUFFER_MAX_SIZE;
		j++;
	}
	return j;
}

void MyRingBuffer::set_byte(int index, byte v)
{
	if (index >= length()) return;
	int i = (uint32_t)(_iTail + index) % BUFFER_MAX_SIZE;
	_aucBuffer[i] = v;
}

void MyRingBuffer::set_bytes(int begin, int end, byte v)
{
	int len = length();
	if (end > len) end = len;
	if (begin >= end) return;
	int i = (uint32_t)(_iTail + begin) % BUFFER_MAX_SIZE;
	end = (uint32_t)(_iTail + end) % BUFFER_MAX_SIZE;
	while (i != end)
	{
		_aucBuffer[i] == v;
		i = (uint32_t)(i + 1) % BUFFER_MAX_SIZE;
	}
}

Esp32::Esp32()
	: m_pSerial(NULL)
	, m_lastSendTime(0)
	, m_busy(false)
	, m_lastCMD(CMD_NONE)
	, m_pWifi(NULL)
	, m_isMUX(false)
	, m_rxDataLinkID(0)
	, m_rxDataRestSize(0)
	, m_rxGetAPIP(0)
	, m_rxGetSTAIP(0)
	, m_rxGetAPMask(0)
	, m_rxGetSTAMask(0)
	, m_apFound(false)
{
}

void Esp32::loop(void)
{
	bool hasRead = false;
	while (m_pSerial->available())
	{
		m_rxBuffer.store_byte(m_pSerial->read());
		hasRead = true;
	}
#ifdef WIFI_DEBUG
	static uint32_t tick = 0;
	if (hasRead || g_ul_ms_ticks - tick > 3000)
	{
		int len = m_rxBuffer.length();
		char* str = new char[len + 1];
		int i;
		for (i = 0; i < len; i++)
		{
			str[i] = m_rxBuffer[i];
		}
		str[i] = 0;
		WIFI_DEBUG_printf("\r\nRECEIVE %d:\r\n%s\r\n", len, str);
		tick = g_ul_ms_ticks;
		delete[] str;
	}
#endif
	if (hasRead)
	{
		parseReceived();
	}
	checkTimeout();
}

void Esp32::init(void)
{
	setSerial(WIFI_SERIAL, WIFI_BAUDRATE, WIFI_FLOWCTR);
}

void Esp32::setSerial(USARTClass& hSerial, int aBaud, bool en)
{
	m_pSerial = &hSerial;
	m_pSerial->setCTSPin(DIGIFI_CTS);
	m_pSerial->enableCTS(en);
	m_pSerial->begin(aBaud);
}

USARTClass& Esp32::getSerial()
{
	return *m_pSerial;
}

bool Esp32::reset(IWifi* pWifi)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_RESET;
	m_pSerial->println("AT+RST");
	return true;
}

bool Esp32::recovery(IWifi* pWifi)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_RECOVERY;
	m_pSerial->println("AT+RESTORE");
	return true;
}

bool Esp32::startSoftAP(IWifi* pWifi)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_SETMODE;
	m_pSerial->println("AT+CWMODE=2");
	return true;
}

bool Esp32::startStation(IWifi* pWifi)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_SETMODE;
	m_pSerial->println("AT+CWMODE=1");
	return true;
}

bool Esp32::startAPStation(IWifi* pWifi)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_SETMODE;
	m_pSerial->println("AT+CWMODE=3");
	return true;
}

bool Esp32::setSoftAP(IWifi* pWifi, const char ssid[], const char pwd[], int ch, EncryptType ecn, int max_conn, bool hidden)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_SETSOFTAP;
	char str[4];
	m_pSerial->print("AT+CWSAP=\"");
	m_pSerial->print(ssid);
	m_pSerial->print("\",\"");
	m_pSerial->print(pwd);
	m_pSerial->print("\",");
	m_pSerial->print(itoa(ch, str, 10));
	m_pSerial->write(',');
	m_pSerial->print(itoa(ecn, str, 10));
	if (max_conn > 0)
	{
		m_pSerial->write(',');
		m_pSerial->print(itoa(max_conn, str, 10));
		m_pSerial->write(',');
		m_pSerial->write('0' + hidden);
	}
	m_pSerial->println();
	return true;
}

bool Esp32::connectAP(IWifi* pWifi, const char ssid[], const char pwd[], const char* bssid)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_CONNECTAP;
	m_pSerial->print("AT+CWJAP=\"");
	m_pSerial->print(ssid);
	m_pSerial->print("\",\"");
	m_pSerial->print(pwd);
	m_pSerial->write('"');
	if (bssid != NULL)
	{
		m_pSerial->print(",\"");
		m_pSerial->print(bssid);
		m_pSerial->write('"');
	}
	m_pSerial->println();
	return true;
}

bool Esp32::configSanAP(IWifi* pWifi, bool sort, uint8_t mask)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_CONFIGSCANAP;
	m_pSerial->print("AT+CWLAPOPT=");
	m_pSerial->write('0' + sort);
	m_pSerial->write(',');
	m_pSerial->print(mask, 10);
	m_pSerial->println();
	return true;
}

bool Esp32::scanAP(IWifi* pWifi, const char ssid[])
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_SCANAP;
	m_pSerial->print("AT+CWLAP");
	if (ssid != NULL)
	{
		m_apFound = true;
		m_pSerial->print("=\"");
		m_pSerial->print(ssid);
		m_pSerial->write('"');
	}
	m_pSerial->println();
	return true;
}

bool Esp32::autoConnAP(IWifi* pWifi, bool isAuto)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_AUTOCONN;
	m_pSerial->print("AT+CWAUTOCONN=");
	m_pSerial->write('0' + isAuto);
	m_pSerial->println();
	return true;
}

