wql7013/ESP32WROOM-WiFi/ESP32WROOM.cpp
bool Esp32::getIP(IWifi* pWifi)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_GETIP;
	m_pSerial->println("AT+CIFSR");
	m_rxGetAPIP = 0;
	m_rxGetSTAIP = 0;
	return true;
}

bool Esp32::getAPIP(IWifi* pWifi)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_GETAPIP;
	m_pSerial->println("AT+CIPAP?");
	return true;
}

bool Esp32::getSTAIP(IWifi* pWifi)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_GETSTAIP;
	m_pSerial->println("AT+CIPSTA?");
	return true;
}

bool Esp32::getNetStatus(IWifi* pWifi)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_GETNETSTATUS;
	m_pSerial->println("AT+CIPSTATUS");
	return true;
}

bool Esp32::setMUX(IWifi* pWifi, bool isMUX)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_SETMUX;
	m_pSerial->print("AT+CIPMUX=");
	m_pSerial->write('0' + isMUX);
	m_pSerial->println();
	m_isMUX = isMUX;
	return true;
}

bool Esp32::startTCPServer(IWifi* pWifi, uint16_t port)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_TCPSERVER;
	m_pSerial->print("AT+CIPSERVER=1,");
	m_pSerial->println(port, 10);
	return true;
}

bool Esp32::stopTCPServer(IWifi* pWifi, uint16_t port)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_TCPSERVER_STOP;
	m_pSerial->print("AT+CIPSERVER=0,");
	m_pSerial->println(port, 10);
	return true;
}

bool Esp32::TCPConnectMUX(IWifi* pWifi, uint8_t link_id, uint32_t remote_ip, uint16_t remote_port)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_TCPCONNECT;
	m_pSerial->print("AT+CIPSTART=");
	m_pSerial->write('0' + link_id);
	m_pSerial->print(",\"TCP\",\"");
	m_pSerial->print(remote_ip >> 24, 10);
	m_pSerial->write('.');
	m_pSerial->print((remote_ip >> 16) & 0xff, 10);
	m_pSerial->write('.');
	m_pSerial->print((remote_ip >> 8) & 0xff, 10);
	m_pSerial->write('.');
	m_pSerial->print(remote_ip & 0xff, 10);
	m_pSerial->print("\",");
	m_pSerial->println(remote_port, 10);
	return true;
}

bool Esp32::TCPConnect(IWifi* pWifi, uint32_t remote_ip, uint16_t remote_port)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_TCPCONNECT;
	m_pSerial->print("AT+CIPSTART=");
	m_pSerial->print("\"TCP\",\"");
	m_pSerial->print(remote_ip >> 24, 10);
	m_pSerial->write('.');
	m_pSerial->print((remote_ip >> 16) & 0xff, 10);
	m_pSerial->write('.');
	m_pSerial->print((remote_ip >> 8) & 0xff, 10);
	m_pSerial->write('.');
	m_pSerial->print(remote_ip & 0xff, 10);
	m_pSerial->print("\",");
	m_pSerial->println(remote_port, 10);
	return true;
}

bool Esp32::UDPConnectMUX(IWifi* pWifi, uint8_t link_id, uint32_t remote_ip, uint16_t remote_port, uint16_t local_port, int mode)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_UDPCONNECT;
	m_pSerial->print("AT+CIPSTART=");
	m_pSerial->write('0' + link_id);
	m_pSerial->print(",\"UDP\",\"");
	m_pSerial->print(remote_ip >> 24, 10);
	m_pSerial->write('.');
	m_pSerial->print((remote_ip >> 16) & 0xff, 10);
	m_pSerial->write('.');
	m_pSerial->print((remote_ip >> 8) & 0xff, 10);
	m_pSerial->write('.');
	m_pSerial->print(remote_ip & 0xff, 10);
	m_pSerial->print("\",");
	m_pSerial->print(remote_port, 10);
	if (local_port > 0)
	{
		m_pSerial->write(',');
		m_pSerial->print(local_port, 10);
		m_pSerial->write(',');
		m_pSerial->write('0' + mode);
	}
	m_pSerial->println();
	return true;
}

bool Esp32::UDPConnect(IWifi* pWifi, uint32_t remote_ip, uint16_t remote_port, uint16_t local_port, int mode)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_UDPCONNECT;
	m_pSerial->print("AT+CIPSTART=");
	m_pSerial->print("\"UDP\",\"");
	m_pSerial->print(remote_ip >> 24, 10);
	m_pSerial->write('.');
	m_pSerial->print((remote_ip >> 16) & 0xff, 10);
	m_pSerial->write('.');
	m_pSerial->print((remote_ip >> 8) & 0xff, 10);
	m_pSerial->write('.');
	m_pSerial->print(remote_ip & 0xff, 10);
	m_pSerial->print("\",");
	m_pSerial->print(remote_port, 10);
	if (local_port > 0)
	{
		m_pSerial->write(',');
		m_pSerial->print(local_port, 10);
		m_pSerial->write(',');
		m_pSerial->write('0' + mode);
	}
	m_pSerial->println();
	return true;
}

bool Esp32::sendBytesMUX(IWifi* pWifi, uint8_t link_id, byte* buffer, size_t size, uint32_t remote_ip, uint16_t remote_port)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_SENDBYTES;
	m_sendBuffer = buffer;
	m_sendSize = size;
	m_pSerial->print("AT+CIPSEND=");
	m_pSerial->write('0' + link_id);
	m_pSerial->write(',');
	m_pSerial->print(size, 10);
	if (remote_ip != 0 && remote_port != 0)
	{
		m_pSerial->print(",\"");
		m_pSerial->print(remote_ip >> 24, 10);
		m_pSerial->write('.');
		m_pSerial->print((remote_ip >> 16) & 0xff, 10);
		m_pSerial->write('.');
		m_pSerial->print((remote_ip >> 8) & 0xff, 10);
		m_pSerial->write('.');
		m_pSerial->print(remote_ip & 0xff, 10);
		m_pSerial->print("\",");
		m_pSerial->print(remote_port, 10);
	}
	m_pSerial->println();
	return true;
}

bool Esp32::sendBytes(IWifi* pWifi, byte* buffer, size_t size, uint32_t remote_ip, uint16_t remote_port)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_SENDBYTES;
	m_sendBuffer = buffer;
	m_sendSize = size;
	m_pSerial->print("AT+CIPSEND=");
	m_pSerial->print(size, 10);
	if (remote_ip != 0 && remote_port != 0)
	{
		m_pSerial->print(",\"");
		m_pSerial->print(remote_ip >> 24, 10);
		m_pSerial->write('.');
		m_pSerial->print((remote_ip >> 16) & 0xff, 10);
		m_pSerial->write('.');
		m_pSerial->print((remote_ip >> 8) & 0xff, 10);
		m_pSerial->write('.');
		m_pSerial->print(remote_ip & 0xff, 10);
		m_pSerial->print("\",");
		m_pSerial->print(remote_port, 10);
	}
	m_pSerial->println();
	return true;
}

