wql7013/ESP32WROOM-WiFi/ESP32WROOM.cpp
bool Esp32::sendStringMUX(IWifi* pWifi, uint8_t link_id, const char s[], uint32_t remote_ip, uint16_t remote_port)
{
	return false;
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_SENDSTRING;
	m_sendBuffer = (byte*)s;
	m_pSerial->print("AT+CIPSENDEX=");
	m_pSerial->write('0' + link_id);
	m_pSerial->write(',');
	m_pSerial->print(SEND_MAXSIZE, 10);
	if (remote_ip != 0 && remote_port != 0)
	{
		m_pSerial->print(",\"");
		m_pSerial->print(remote_ip >> 24, 10);
		m_pSerial->write('.');
		m_pSerial->print((remote_ip >> 16) & 0xff, 10);
		m_pSerial->write('.');
		m_pSerial->print((remote_ip >> 8) & 0xff, 10);
		m_pSerial->write('.');
		m_pSerial->print(remote_ip & 0xff, 10);
		m_pSerial->print("\",");
		m_pSerial->print(remote_port, 10);
	}
	m_pSerial->println();
	return true;
}

bool Esp32::sendString(IWifi* pWifi, const char s[], uint32_t remote_ip, uint16_t remote_port)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_SENDSTRING;
	m_sendBuffer = (byte*)s;
	m_pSerial->print("AT+CIPSENDEX=");
	m_pSerial->print(SEND_MAXSIZE, 10);
	if (remote_ip != 0 && remote_port != 0)
	{
		m_pSerial->print(",\"");
		m_pSerial->print(remote_ip >> 24, 10);
		m_pSerial->write('.');
		m_pSerial->print((remote_ip >> 16) & 0xff, 10);
		m_pSerial->write('.');
		m_pSerial->print((remote_ip >> 8) & 0xff, 10);
		m_pSerial->write('.');
		m_pSerial->print(remote_ip & 0xff, 10);
		m_pSerial->print("\",");
		m_pSerial->print(remote_port, 10);
	}
	m_pSerial->println();
	return true;
}

bool Esp32::closeConnect(IWifi* pWifi, uint8_t link_id)
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_CLOSECONNECT;
	m_pSerial->print("AT+CIPCLOSE=");
	m_pSerial->write('0' + link_id);
	m_pSerial->println();
	return true;
}

bool Esp32::DomainResolution(IWifi* pWifi, char domain[])
{
	if (m_busy)
	{
		return false;
	}
	m_busy = true;
	m_lastSendTime = g_ul_ms_ticks;
	m_pWifi = pWifi;
	m_lastCMD = CMD_DOMAIN;
	m_pSerial->print("AT+CIPDOMAIN=\"");
	m_pSerial->print(domain);
	m_pSerial->println("\"");
	return true;
}

void Esp32::doSend(void)
{
	m_lastSendTime = g_ul_ms_ticks;
	if (m_lastCMD == CMD_SENDSTRING)
	{
		m_lastCMD = CMD_DOSEND;
		size_t size = strnlen((const char*)m_sendBuffer, SEND_MAXSIZE);
		wdt_restart(WDT);
		m_pSerial->write(m_sendBuffer, size);
	}
	else if (m_lastCMD == CMD_SENDBYTES)
	{
		m_lastCMD = CMD_DOSEND;
		wdt_restart(WDT);
		m_pSerial->write(m_sendBuffer, m_sendSize);
	}
}

void Esp32::parseReceived(void)
{
	while (true)
	{
		int len = m_rxBuffer.length();
		if (len == 0)
			break;
		if (processNetworkData()) // if matched command but not enough data
			break;
		if (processDisconnectAP()) // if matched command but not enough data
			break;
		if (processGetIP()) // if matched command but not enough data
			break;
		if (processGetAPIP()) // if matched command but not enough data
			break;
		if (processGetSTAIP()) // if matched command but not enough data
			break;
		if (processDomainResolution()) // if matched command but not enough data
			break;
		if (processSend()) // if matched command but not enough data
			break;
		if (processSendEnd()) // if matched command but not enough data
			break;
		if (processReset()) // if matched command but not enough data
			break;
		if (processBusy()) // if matched command but not enough data
			break;
		if (processError()) // if matched command but not enough data
			break;
		if (processOK()) // if matched command but not enough data
			break;
		if (len == m_rxBuffer.length()) // if not processed
		{
			int index = m_rxBuffer.find_word(WORD_CRLF);
			if (index != -1)
				m_rxBuffer.cut(index + 2);
			else if (m_rxBuffer.is_full())
			{
				m_rxBuffer.clear();
			}
			else
				break;
		}
	}
}

bool Esp32::processNetworkData(void)
{
	int len = m_rxBuffer.length();
	// if receiving network data not end
	if (m_rxDataRestSize > 0)
	{
		if (m_rxDataRestSize > len)
		{
			if (m_pWifi != NULL)
				m_pWifi->cbReceivedData(m_rxDataLinkID, m_rxBuffer, 0, len);
			m_rxBuffer.clear();
			m_rxDataRestSize -= len;
			return true;
		}
		else
		{
			if (m_pWifi != NULL)
				m_pWifi->cbReceivedData(m_rxDataLinkID, m_rxBuffer, 0, m_rxDataRestSize);
			m_rxBuffer.cut(m_rxDataRestSize);
			m_rxDataRestSize = 0;
		}
	}
	while (true)
	{
		strip();
		len = m_rxBuffer.length();
		int index = m_rxBuffer.find_word(WORD_CRLF);
		// if received network data
		if (m_rxBuffer.cmp_bytes((byte*)"+IPD,", 5))
		{
			bool hasError = false;
			int offset = (int)m_isMUX << 1;
			if (len < 7 + offset && index == -1) // if command not end, wait for more data
				return true;
			int index1 = m_rxBuffer.find_byte(':', 6 + offset, index); // get the start sign of the network data
			if (index1 != -1)
			{
				int link_id;
				if (m_isMUX) // if multi-connection mode
				{
					link_id = m_rxBuffer.read_byte(5) - '0';
				}
				else
				{
					link_id = 0;
				}
				if (link_id >= 0 && link_id <= 4) // if link_id in the correct range
				{
					int index2 = m_rxBuffer.find_byte(',', 6 + offset, index1);
					if (index2 == -1 || index2 > index1)
					{
						index2 = index1;
					}
					int n_len = index2 - 5 - offset;
					if (n_len > 0 && n_len < 6) // data length should be less than 6 figures
					{
						char s[6];
						int c = m_rxBuffer.read_bytes((byte*)s, n_len, 5 + offset);
						s[c] = 0;
						int n = atoi(s);
						if (len < index1 + n + 1)
						{
							if (m_pWifi != NULL)
							{
								m_pWifi->cbReceivedData(link_id, m_rxBuffer, index1 + 1, len);
							}
							m_rxDataLinkID = link_id;
							m_rxDataRestSize = n - (len - (index1 + 1));
							m_rxBuffer.clear();
							return true;
						}
						else if (n > 0)
						{
							if (m_pWifi != NULL)
								m_pWifi->cbReceivedData(link_id, m_rxBuffer, index1 + 1, index1 + 1 + n);
							m_rxBuffer.cut(index1 + 1 + n);
							continue;
						}
						else
							hasError = true;
					}
					else
						hasError = true;
				}
				else
					hasError = true;
			}
			else if (len > 43)
			{
				hasError = true;
			}
			else
				return true;

			if (index != -1)
			{
				m_rxBuffer.cut(index + 2);
				continue;
			}
			else
			{
				m_rxBuffer.clear();
				return false;
			}
		}
		else
		{
			return false;
		}
	}
	return false;
}

