wql7013/ESP32WROOM-WiFi/ESP32WROOM.cpp
bool Esp32::processDisconnectAP(void)
{
	strip();
	if (m_rxBuffer.cmp_bytes((byte*)"WIFI DISCONNECT\r\n", 17))
	{
		if (m_pWifi != NULL)
			m_pWifi->cbDisconnectAP();
		m_rxBuffer.cut(17);
	}
	return false;
}

bool Esp32::processGetIP(void)
{
	if (m_lastCMD != CMD_GETIP)
		return false;
	while (true)
	{
		strip();
		bool isAPIP = m_rxBuffer.cmp_bytes((byte*)"+CIFSR:APIP,\"", 13);
		bool isSTAIP = m_rxBuffer.cmp_bytes((byte*)"+CIFSR:STAIP,\"", 14);
		if (!(isAPIP || isSTAIP))
			break;
		int len = m_rxBuffer.length();
		int index = m_rxBuffer.find_word(WORD_CRLF);
		int offset = (int)isSTAIP;
		if (len < 30 + offset && index == -1) // if command not end, wait more data
			return true;
		else if (index == -1) // if line too long and no CRLF, clear incorrect data
		{
			if (m_pWifi != NULL)
			{
				m_pWifi->cbGetIP(RESPONSE_UNKNOWN_ERROR, 0, 0);
				WIFI_DEBUG_printf("\r\ERROR %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
			}
			m_rxBuffer.clear();
			m_lastCMD = CMD_NONE;
			m_busy = false;
			return false;
		}
		else if (index > 31 + offset) // if line too long with CRLF, cut incorrect data
		{
			if (m_pWifi != NULL)
			{
				m_pWifi->cbGetIP(RESPONSE_UNKNOWN_ERROR, 0, 0);
				WIFI_DEBUG_printf("\r\ERROR %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
			}
			m_rxBuffer.cut(index + 2); // cut this line
			m_lastCMD = CMD_NONE;
			m_busy = false;
			break;
		}
		int p1, p2, p3, p4;
		char s[18];
		int c = m_rxBuffer.read_bytes((byte*)s, 17, 13 + offset);
		s[c] = 0;
		int n = sscanf(s, "%d.%d.%d.%d", &p1, &p2, &p3, &p4);
		if (n < 4)
		{
			m_rxBuffer.cut(index + 2);
			continue;
		}
		uint32_t ip = ((uint32_t)p1 << 24) | ((uint32_t)p2 << 16) | ((uint32_t)p3 << 8) | (uint32_t)p4;
		if (isAPIP)
			m_rxGetAPIP = ip;
		else
			m_rxGetSTAIP = ip;
		m_rxBuffer.cut(index + 2); // processed, cut this line
	}

	strip();
	if (m_rxBuffer.cmp_bytes((byte*)"OK\r\n", 4))
	{
		if (m_pWifi != NULL)
			m_pWifi->cbGetIP(RESPONSE_OK, m_rxGetAPIP, m_rxGetSTAIP);
		m_rxBuffer.cut(4); // cut this line
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
	return false;
}

bool Esp32::processGetAPIP(void)
{
	if (m_lastCMD != CMD_GETAPIP)
		return false;
	while (true)
	{
		strip();
		int len = m_rxBuffer.length();
		bool isIP = false, isMask = false, isGateway = false;
		if (len < 11)
			break;
		else if (m_rxBuffer.cmp_bytes((byte*)"+CIPAP:ip:\"", 11))
			isIP = true;
		else if (m_rxBuffer.cmp_bytes((byte*)"+CIPAP:netmask:\"", 16))
			isMask = true;
		else if (m_rxBuffer.cmp_bytes((byte*)"+CIPAP:gateway:\"", 16))
			isGateway = true;
		if (!(isIP || isMask || isGateway))
			break;
		int index = m_rxBuffer.find_word(WORD_CRLF);
		if (isGateway) // if gateway, ignore
		{
			if (index != -1)
			{
				m_rxBuffer.cut(index + 2); // cut this line
				continue;
			}
			else
				return true;
		}
		int offset = (int)isMask + ((int)isMask << 2);
		if (len < 29 + offset && index == -1) // if command not end, wait more data
			return true;
		else if (index == -1) // if line too long and no CRLF, clear incorrect data
		{
			if (m_pWifi != NULL)
			{
				m_pWifi->cbGetAPIP(RESPONSE_UNKNOWN_ERROR, 0, 0);
				WIFI_DEBUG_printf("\r\ERROR %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
			}
			m_rxBuffer.clear();
			m_lastCMD = CMD_NONE;
			m_busy = false;
			return false;
		}
		else if (index > 27 + offset) // if line too long with CRLF, cut incorrect data
		{
			if (m_pWifi != NULL)
			{
				m_pWifi->cbGetAPIP(RESPONSE_UNKNOWN_ERROR, 0, 0);
				WIFI_DEBUG_printf("\r\ERROR %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
			}
			m_rxBuffer.cut(index + 2); // cut this line
			m_lastCMD = CMD_NONE;
			m_busy = false;
			continue;
		}
		int p1, p2, p3, p4;
		char s[18];
		int c = m_rxBuffer.read_bytes((byte*)s, 15, 11 + offset);
		s[c] = 0;
		int n = sscanf(s, "%d.%d.%d.%d", &p1, &p2, &p3, &p4);
		if (n < 4)
		{
			m_rxBuffer.cut(index + 2);
			continue;
		}
		uint32_t ip = ((uint32_t)p1 << 24) | ((uint32_t)p2 << 16) | ((uint32_t)p3 << 8) | (uint32_t)p4;
		if (isIP)
			m_rxGetAPIP = ip;
		else
			m_rxGetAPMask = ~ip;
		m_rxBuffer.cut(index + 2); // processed, cut this line
	}

	strip();
	if (m_rxBuffer.cmp_bytes((byte*)"OK\r\n", 4))
	{
		if (m_pWifi != NULL)
			m_pWifi->cbGetAPIP(RESPONSE_OK, m_rxGetAPIP, m_rxGetAPMask);
		m_rxBuffer.cut(4); // cut this line
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
	return false;
}

bool Esp32::processGetSTAIP(void)
{
	if (m_lastCMD != CMD_GETSTAIP)
		return false;
	while (true)
	{
		strip();
		int len = m_rxBuffer.length();
		bool isIP = false, isMask = false, isGateway = false;
		if (len < 11)
			break;
		else if (m_rxBuffer.cmp_bytes((byte*)"+CIPSTA:ip:\"", 12))
			isIP = true;
		else if (m_rxBuffer.cmp_bytes((byte*)"+CIPSTA:netmask:\"", 17))
			isMask = true;
		else if (m_rxBuffer.cmp_bytes((byte*)"+CIPSTA:gateway:\"", 17))
			isGateway = true;
		if (!(isIP || isMask || isGateway))
			break;
		int index = m_rxBuffer.find_word(WORD_CRLF);
		if (isGateway) // if gateway, ignore
		{
			if (index != -1)
			{
				m_rxBuffer.cut(index + 2); // cut this line
				continue;
			}
			else
				return true;
		}
		int offset = (int)isMask + ((int)isMask << 2);
		if (len < 30 + offset && index == -1) // if command not end, wait more data
			return true;
		else if (index == -1) // if line too long and no CRLF, clear incorrect data
		{
			if (m_pWifi != NULL)
			{
				m_pWifi->cbGetSTAIP(RESPONSE_UNKNOWN_ERROR, 0, 0);
				WIFI_DEBUG_printf("\r\ERROR %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
			}
			m_rxBuffer.clear();
			m_lastCMD = CMD_NONE;
			m_busy = false;
			return false;
		}
		else if (index > 28 + offset) // if line too long with CRLF, cut incorrect data
		{
			if (m_pWifi != NULL)
			{
				m_pWifi->cbGetSTAIP(RESPONSE_UNKNOWN_ERROR, 0, 0);
				WIFI_DEBUG_printf("\r\ERROR %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
			}
			m_rxBuffer.cut(index + 2); // cut this line
			m_lastCMD = CMD_NONE;
			m_busy = false;
			break;
		}
		int p1, p2, p3, p4;
		char s[18];
		int c = m_rxBuffer.read_bytes((byte*)s, 15, 12 + offset);
		s[c] = 0;
		int n = sscanf(s, "%d.%d.%d.%d", &p1, &p2, &p3, &p4);
		if (n < 4)
		{
			m_rxBuffer.cut(index + 2);
			continue;
		}
		uint32_t ip = ((uint32_t)p1 << 24) | ((uint32_t)p2 << 16) | ((uint32_t)p3 << 8) | (uint32_t)p4;
		if (isIP)
			m_rxGetSTAIP = ip;
		else
			m_rxGetSTAMask = ~ip;
		m_rxBuffer.cut(index + 2); // processed, cut this line
	}

	strip();
	if (m_rxBuffer.cmp_bytes((byte*)"OK\r\n", 4))
	{
		if (m_pWifi != NULL)
			m_pWifi->cbGetSTAIP(RESPONSE_OK, m_rxGetSTAIP, m_rxGetSTAMask);
		m_rxBuffer.cut(4); // cut this line
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
	return false;
}

