wql7013/ESP32WROOM-WiFi/ESP32WROOM.cpp
bool Esp32::processDomainResolution(void)
{
	if (m_lastCMD != CMD_DOMAIN)
		return false;
	strip();
	if (m_rxBuffer.cmp_bytes((byte*)"+CIPDOMAIN:", 11))
	{
		int len = m_rxBuffer.length();
		int index = m_rxBuffer.find_word(WORD_CRLF);
		if (len < 28 && index == -1) // if command not end, wait more data
			return true;
		else if (index == -1) // if line too long and no CRLF, clear incorrect data
		{
			if (m_pWifi != NULL)
			{
				m_pWifi->cbDomainResolution(RESPONSE_UNKNOWN_ERROR, 0);
				WIFI_DEBUG_printf("\r\ERROR %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
			}
			m_rxBuffer.clear();
			m_lastCMD = CMD_NONE;
			m_busy = false;
			return false;
		}
		else if (index > 26) // if line too long with CRLF, cut incorrect data
		{
			if (m_pWifi != NULL)
			{
				m_pWifi->cbDomainResolution(RESPONSE_UNKNOWN_ERROR, 0);
				WIFI_DEBUG_printf("\r\ERROR %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
			}
			m_rxBuffer.cut(index + 2); // cut this line
			m_lastCMD = CMD_NONE;
			m_busy = false;
			return false;
		}
		int p1, p2, p3, p4;
		char s[18];
		int c = m_rxBuffer.read_bytes((byte*)s, 17, 11);
		s[c] = 0;
		int n = sscanf(s, "%d.%d.%d.%d", &p1, &p2, &p3, &p4);
		if (n < 4)
		{
			if (m_pWifi != NULL)
			{
				m_pWifi->cbDomainResolution(RESPONSE_UNKNOWN_ERROR, 0);
				WIFI_DEBUG_printf("\r\ERROR %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
			}
			m_rxBuffer.cut(index + 2);
			m_lastCMD = CMD_NONE;
			m_busy = false;
			return false;
		}
		uint32_t ip = ((uint32_t)p1 << 24) | ((uint32_t)p2 << 16) | ((uint32_t)p3 << 8) | (uint32_t)p4;
		if (m_pWifi != NULL)
		{
			m_pWifi->cbDomainResolution(RESPONSE_OK, ip);
		}
		m_rxBuffer.cut(index + 2); // processed, cut this line
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
	else if (m_rxBuffer.cmp_bytes((byte*)"ERROR\r\n", 7))
	{
		if (m_pWifi != NULL)
		{
			m_pWifi->cbDomainResolution(RESPONSE_DOMAIN_FAIL, 0);
			WIFI_DEBUG_printf("\r\ERROR %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
		}
		m_rxBuffer.cut(7);
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
	return false;
}

bool Esp32::processSend(void)
{
	if (m_lastCMD != CMD_SENDBYTES && m_lastCMD != CMD_SENDSTRING)
		return false;
	strip();
	if (m_rxBuffer[0] == '>')
	{
		doSend();
		m_rxBuffer.cut(1);
	}
	return false;
}

bool Esp32::processSendEnd(void)
{
	if (m_lastCMD != CMD_DOSEND)
		return false;
	strip();
	if (m_rxBuffer.cmp_bytes((byte*)"SEND OK\r\n", 9))
	{
		if (m_pWifi != NULL)
			m_pWifi->cbSend(RESPONSE_OK);
		m_rxBuffer.cut(9);
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
	else if (m_rxBuffer.cmp_bytes((byte*)"SEND FAIL\r\n", 11))
	{
		if (m_pWifi != NULL)
		{
			m_pWifi->cbSend(RESPONSE_SEND_FAILED);
			WIFI_DEBUG_printf("\r\FAILED %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
		}
		m_rxBuffer.cut(11);
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
	else if (m_rxBuffer.cmp_bytes((byte*)"ERROR\r\n", 7))
	{
		if (m_pWifi != NULL)
		{
			m_pWifi->cbSend(RESPONSE_SEND_ERROR);
			WIFI_DEBUG_printf("\r\ERROR %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
		}
		m_rxBuffer.cut(7);
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
	return false;
}

bool Esp32::processScanAP(void)
{
	if (m_lastCMD != CMD_SCANAP)
		return false;
	strip();
	if (m_rxBuffer.cmp_bytes((byte*)"+CWLAP:", 7))
	{
		int len = m_rxBuffer.length();
		int index = m_rxBuffer.find_word(WORD_CRLF);
		if (index == -1) // if command not end, wait more data
			return true;
		m_apFound = true;
		m_rxBuffer.cut(index + 2);
	}
	return false;
}

bool Esp32::processConnectAP(void)
{
	if (m_lastCMD != CMD_CONNECTAP)
		return false;
	strip();
	if (m_rxBuffer.cmp_bytes((byte*)"WIFI GOT IP\r\n\r\nOK\r\n", 19))
	{
		if (m_pWifi != NULL)
			m_pWifi->cbConnectAP(RESPONSE_OK);
		m_rxBuffer.cut(19);
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
	else if (m_rxBuffer.cmp_bytes((byte*)"ERROR\r\n", 7))
	{
		if (m_pWifi != NULL)
		{
			m_pWifi->cbConnectAP(RESPONSE_CONNECTAP_FAIL);
			WIFI_DEBUG_printf("\r\ERROR %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
		}
		m_rxBuffer.cut(7);
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
	return false;
}

bool Esp32::processReset(void)
{
	if (m_lastCMD != CMD_RESET)
		return false;
	strip();
	if (m_rxBuffer.cmp_bytes((byte*)"ready\r\n", 7))
	{
		if (m_pWifi != NULL)
			m_pWifi->cbReset(RESPONSE_OK);
		m_rxBuffer.cut(7);
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
	return false;
}

bool Esp32::processBusy(void)
{
	if (m_lastCMD == CMD_DOSEND)
		return false;
	strip();
	if (m_rxBuffer.cmp_bytes((byte*)"busy p...\r\n", 11))
	{
		if (m_pWifi != NULL)
		{
			responseStatus(RESPONSE_BUSY);
			WIFI_DEBUG_printf("\r\busy %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
		}
		m_rxBuffer.cut(11);
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
	return false;
}

bool Esp32::processError(void)
{
	strip();
	if (m_rxBuffer.cmp_bytes((byte*)"ERROR\r\n", 7))
	{
		if (m_pWifi != NULL)
		{
			responseStatus(RESPONSE_UNKNOWN_ERROR);
			WIFI_DEBUG_printf("\r\ERROR %s\t%u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime);
		}
		m_rxBuffer.cut(7);
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
	return false;
}

bool Esp32::processOK(void)
{
	strip();
	if (m_rxBuffer.cmp_bytes((byte*)"OK\r\n", 4))
	{
		if (m_pWifi != NULL)
		{
			// reset, geting ip, geting AP/STA ip, domain resolution, sending data and connecting AP are judged to be OK in a specific way
			switch (m_lastCMD)
			{
			case Esp32::CMD_SETMODE:
				m_pWifi->cbSetMode(RESPONSE_OK);
				m_lastCMD = CMD_NONE;
				m_busy = false;
				break;
			case Esp32::CMD_SETSOFTAP:
				m_pWifi->cbSetMode(RESPONSE_OK);
				m_lastCMD = CMD_NONE;
				m_busy = false;
				break;
			case Esp32::CMD_SETMUX:
				m_pWifi->cbSetMUX(RESPONSE_OK);
				m_lastCMD = CMD_NONE;
				m_busy = false;
				break;
			case Esp32::CMD_SCANAP:
				m_pWifi->cbScanAP(RESPONSE_OK, m_apFound);
				m_lastCMD = CMD_NONE;
				m_busy = false;
				break;
			case Esp32::CMD_AUTOCONN:
				m_pWifi->cbAutoConnAP(RESPONSE_OK);
				m_lastCMD = CMD_NONE;
				m_busy = false;
				break;
			case Esp32::CMD_CONNECTAP:
				m_pWifi->cbConnectAP(RESPONSE_OK);
				m_lastCMD = CMD_NONE;
				m_busy = false;
				break;
			case Esp32::CMD_UDPCONNECT:
				m_pWifi->cbUDPConnect(RESPONSE_OK);
				m_lastCMD = CMD_NONE;
				m_busy = false;
				break;
			default:
				break;
			}
		}
		m_rxBuffer.cut(4);
	}
	return false;
}

