wql7013/ESP32WROOM-WiFi/ESP32WROOM.cpp
void Esp32::checkTimeout(void)
{
	uint32_t timeout = NORMAL_TIMEOUT;
	switch (m_lastCMD)
	{
	case Esp32::CMD_NONE:
		return;
	case Esp32::CMD_RESET: // reset will take more time
		timeout = RESET_TIMEOUT;
		break;
	case Esp32::CMD_SCANAP: // scaning ap will take more time
		timeout = SCANAP_TIMEOUT;
		break;
	case Esp32::CMD_CONNECTAP: // connecting ap will take more time
		timeout = CONNECTAP_TIMEOUT;
		break;
	default:
		break;
	}
	if (g_ul_ms_ticks - m_lastSendTime > timeout)
	{
		if (m_pWifi != NULL)
		{
			responseStatus(RESPONSE_TIMEOUT);
			WIFI_DEBUG_printf("\r\ntimeout %s\t%u %u %u\r\n", printCMD(m_lastCMD), g_ul_ms_ticks, m_lastSendTime, timeout);
		}
		m_lastCMD = CMD_NONE;
		m_busy = false;
	}
}

void Esp32::strip(void)
{
	// strip CR/LF at the start
	int len = m_rxBuffer.length();
	int i;
	for (i = 0; i < len; i++)
	{
		char c = m_rxBuffer[i];
		if (c != '\r' && c != '\n')
			break;
	}
	m_rxBuffer.cut(i);
}

void Esp32::responseStatus(ResponseType state)
{
	switch (m_lastCMD)
	{
	case Esp32::CMD_NONE:
		break;
	case Esp32::CMD_RESET:
		m_pWifi->cbReset(state);
		break;
	case Esp32::CMD_RECOVERY:
		break;
	case Esp32::CMD_SETMODE:
		m_pWifi->cbSetMode(state);
		break;
	case Esp32::CMD_SETSOFTAP:
		m_pWifi->cbSetSoftAP(state);
		break;
	case Esp32::CMD_CONNECTAP:
		m_pWifi->cbConnectAP(state);
		break;
	case Esp32::CMD_CONFIGSCANAP:
		break;
	case Esp32::CMD_SCANAP:
		m_pWifi->cbScanAP(state, m_apFound);
		break;
	case Esp32::CMD_AUTOCONN:
		m_pWifi->cbAutoConnAP(state);
		break;
	case Esp32::CMD_GETIP:
		m_pWifi->cbGetIP(state, 0, 0);
		break;
	case Esp32::CMD_GETAPIP:
		m_pWifi->cbGetAPIP(state, 0, 0);
		break;
	case Esp32::CMD_GETSTAIP:
		m_pWifi->cbGetSTAIP(state, 0, 0);
		break;
	case Esp32::CMD_GETNETSTATUS:
		break;
	case Esp32::CMD_SETMUX:
		m_pWifi->cbSetMUX(state);
		break;
	case Esp32::CMD_TCPSERVER:
		break;
	case Esp32::CMD_TCPSERVER_STOP:
		break;
	case Esp32::CMD_TCPCONNECT:
		break;
	case Esp32::CMD_UDPCONNECT:
		m_pWifi->cbUDPConnect(state);
		break;
	case Esp32::CMD_SENDBYTES:
		m_pWifi->cbSend(state);
		break;
	case Esp32::CMD_SENDSTRING:
		m_pWifi->cbSend(state);
		break;
	case Esp32::CMD_DOSEND:
		break;
	case Esp32::CMD_CLOSECONNECT:
		break;
	case Esp32::CMD_DOMAIN:
		m_pWifi->cbDomainResolution(state, 0);
		break;
	default:
		break;
	}
}

const char* Esp32::printCMD(CMDType cmd)
{
	switch (cmd)
	{
	case Esp32::CMD_NONE:
		return("CMD_NONE");
		break;
	case Esp32::CMD_RESET:
		return("CMD_RESET");
		break;
	case Esp32::CMD_RECOVERY:
		return("CMD_RECOVERY");
		break;
	case Esp32::CMD_SETMODE:
		return("CMD_SETMODE");
		break;
	case Esp32::CMD_SETSOFTAP:
		return("CMD_SETSOFTAP");
		break;
	case Esp32::CMD_CONNECTAP:
		return("CMD_CONNECTAP");
		break;
	case Esp32::CMD_CONFIGSCANAP:
		return("CMD_CONFIGSCANAP");
		break;
	case Esp32::CMD_SCANAP:
		return("CMD_SCANAP");
		break;
	case Esp32::CMD_GETIP:
		return("CMD_GETIP");
		break;
	case Esp32::CMD_GETAPIP:
		return("CMD_GETAPIP");
		break;
	case Esp32::CMD_GETSTAIP:
		return("CMD_GETSTAIP");
		break;
	case Esp32::CMD_GETNETSTATUS:
		return("CMD_GETNETSTATUS");
		break;
	case Esp32::CMD_SETMUX:
		return("CMD_SETMUX");
		break;
	case Esp32::CMD_TCPSERVER:
		return("CMD_TCPSERVER");
		break;
	case Esp32::CMD_TCPSERVER_STOP:
		return("CMD_TCPSERVER_STOP");
		break;
	case Esp32::CMD_TCPCONNECT:
		return("CMD_TCPCONNECT");
		break;
	case Esp32::CMD_UDPCONNECT:
		return("CMD_UDPCONNECT");
		break;
	case Esp32::CMD_SENDBYTES:
		return("CMD_SENDBYTES");
		break;
	case Esp32::CMD_SENDSTRING:
		return("CMD_SENDSTRING");
		break;
	case Esp32::CMD_DOSEND:
		return("CMD_DOSEND");
		break;
	case Esp32::CMD_CLOSECONNECT:
		return("CMD_CLOSECONNECT");
		break;
	case Esp32::CMD_DOMAIN:
		return("CMD_DOMAIN");
		break;
	default:
		return("CMD_error!!!!!");
		break;
	}
}

Esp32 esp32;
